prodotto-kar/src/main/resources/NoPlugin/Esempi/DCSanita_FSE_2008-01_comunicaEventoSpecialistico.in.xml

<?xml version="1.0" encoding="ISO-8859-1"?> 
<!--
<TestInfo>
	<Autore>Mauro Martello</Autore>
	<DataPreparazione>01/10/2008</DataPreparazione>
	<CodiceTest>IN.8052000012</CodiceTest>
	<CodiceContesto>C06</CodiceContesto>
	<TipoTest>F</TipoTest>
	<Priorita>H</Priorita>
	<DescrizioneCaso>Controllo evento:Invocazione metodo identificaPrescrizione del GSSC per identificare la prescrizione specificando lo IUP. La prescrizione non esiste nel db. </DescrizioneCaso>
	<DescrizioneRisultatoAtteso>OK - Come da specifiche funzionali nel caso di mancanza della prescrizione non verranno sollevati warning</DescrizioneRisultatoAtteso>
</TestInfo>
-->
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance" xmlns:xsd="http://www.w3.org/1999/XMLSchema" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" soap-env:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
<soap-env:Header>
<t:CoopContext xmlns:t="http://www.crs.lombardia.it/schemas/mw/2004-01/coopcontext/">
		<Transport>
			<Mode>Sync</Mode>
			<Dest>DCSanita</Dest>
		</Transport>
			<Security>
			<FunContext>
				<credential>
					<validity>
						<emittedDate>15/11/2005+10:59:18,531</emittedDate>
						<sessionMaxTime>15/11/2005+10:59:18,531</sessionMaxTime>
					</validity>
					<vrs>
						<mjr>1</mjr>
						<min>0</min>
					</vrs>
					<ctf>
						<reg>
							<cod/>
							<des/>
						</reg>
						<app>
							<cod/>
							<des/>
						</app>
						<pro>
							<cod/>
							<des/>
						</pro>
						<ter>
							<cod/>
							<des/>
						</ter>
						<str>
							<cod>030964</cod>
							<des/>
						</str>
						<pre>
							<cod>03015000</cod>
							<des/>
						</pre>
						<rep>
							<cod/>
							<des/>
						</rep>
					</ctf>
					<role>
						<code>12</code>
						<description>Specialista Ambulatoriale</description>
					</role>
					<userId>CCCBLL79A01Z368C</userId>
					<iupSeed>12345</iupSeed>
				</credential>
			</FunContext>
			<CitCardPresent>false</CitCardPresent>
			<CitAuth>false</CitAuth>
			<CitCF></CitCF>
			<CitSmartCardSN></CitSmartCardSN>
		</Security>
		<Sla>
			<Log>
				<Global>
					<TrackID>1132048757203</TrackID>
					<Timestamp>15/11/2005+10:59:18,562</Timestamp>
				</Global>
			</Log>
		</Sla>
		</t:CoopContext>
		<a:AppContext xmlns:a="http://www.crs.lombardia.it/schemas/mw/2004-01/appcontext/">
			<Request clientProd="DCSanita" clientVer="1.0"/>
		</a:AppContext>
	</soap-env:Header>
	<soap-env:Body>
	<m:FSE.comunicaEventoSpecialistico
  xmlns:m="http://www.crs.lombardia.it/schemas/DCSanita/FSE/2008-01/comunicaEventoSpecialistico/"
  dataSetVersion="1.0">
        <eventoSpecialistico>
    <numeroProgressivo>21</numeroProgressivo>
	<strutturaErogazione>
       <idEnte>690666</idEnte>
       <idPresidio>002901</idPresidio>
    </strutturaErogazione>
    <cittadino>
       <idCittadino tipo="CF">GBBGCB70A01Z368C</idCittadino>
       <nomeCittadino>GIOBBE</nomeCittadino>
       <cognomeCittadino>GIACOBBE</cognomeCittadino>
       <sessoCittadino>M</sessoCittadino>
       <dataNascitaCittadino>19930614</dataNascitaCittadino>
       <idComuneNascitaCittadino>097042</idComuneNascitaCittadino>
    </cittadino>
    <idTipoComunicazione>A</idTipoComunicazione>
	<IUP>TEST000230</IUP>
	<idPrescrizioneRUR>12345678</idPrescrizioneRUR>
    <dataAccettazione>20080801</dataAccettazione>
    <dataPrenotazione>20080802</dataPrenotazione>
    <prestazioniAssociate>
       <prestazione>
         <idPrestazioneSISS>90.03.4</idPrestazioneSISS>
         <flagAggiuntiva>N</flagAggiuntiva>
      </prestazione>
    </prestazioniAssociate>
  </eventoSpecialistico>
</m:FSE.comunicaEventoSpecialistico>
</soap-env:Body>
</soap-env:Envelope>
